#encoding=utf-8
import data
import json
import httplib
import urllib

class LBS:
    #def __init__(self,browser):
    #    self.browser = browser
    
    def try_shanghai(self):
        httpClient = None
        #(73.04,54.27) (73.04,18.00) (137.50,53.40) (137.50,21.23)  新疆（73.45,39.42）（78.97,34.31）（87.78,49.40）（96.45,42.84）
        #安徽[上]（115.78,33.61）（117.78,33.63）（117.92,32.69）
        #安徽（115.79,33.88）（117.47,34.02）（118.72,29.75）
        #安徽[中上]（115.55,33.35）（117.75,33.55）（117.92,32.80）
        #北京[包含大部分]（115.89,41.01）（117.36 41.11）（115.50,39.48）
        #河北[承德/廊坊/唐山]（117.64,31.36）（118.84,41.24）（116.57,39.36）
        #河北[保定/天津/沧州](115.24,39.35）（117.29,39.44）（115.27,38.20）
        #河北[保定斜左上/邯郸]（114.59,39.34）（117.45,39.35）（114.36,36.43）
        #河南[长治/安阳/焦作]（113.04,36.26）（115.45,36.17）（113.16,35.38）（114.83,35.20）
        #河南[三门峡/郑州/商丘]（110.45,34.62）（115.36,34.84）（116.15,34.56）
        #河南[洛阳/亳州/驻马店]（110.43,34.60）（116.64,33.96）（111.03,33.45）（114.88,33.09）
        #河南[信阳]（111.66,32.66）（115.91,32.53）（115.36,31.44）
        #黑龙江[大兴安岭地区]（121.22,52.63）（121.53,53.35）（124.38,51.28）（126.11,52.78）
        #黑龙江[呼玛县]（125.19,51.64）（126.44,51.99）（125.12,49.20）（127.80,49.66）
        #黑龙江[伊春/齐齐哈尔]（125.24,49.44）（122.37,47.37）（135.06,48.45）（123.07,46.61）
        #湖北[十堰/宜昌/孝感/随州]（110.82,32.70）（111.26,30.80）（115.45,31.04）（113.37,31.75）
        #湖北[恩施土家族苗族自治区/巴东县]（108.64,30.44）（110.36,31.06）（109.21,29.19）（110.91,30.23）
        #湖北[荆州/武汉/黄石/咸宁]（112.26,30.40）（114.30,30.67）（115.02,30.28）（114.30,29.91）
        #湖北[赤壁/武穴/通城县/瑞昌]（113.67,29.78）（115.58,29.86）（113.82,29.26）（115.69,29.69）
        #湖南[张家界/常德/岳阳]（110.80,30.12）（111.68,29.09）（113.12,29.41）
        #湖南[湘西土家族/株洲/铜仁]（109.29,28.99）（113.67,27.87）（109.18,27.80）
        #湖南[黎平县/零陵区]（113.68,27.73）（109.28,26.34）（114.02,26.25）
        #湖南[全州县/资兴/汝城县]（111.24,26.10）（114.23,26.18）（111.44,24.70）（113.79,25.36）
        #湖南[道县/汝城县/江华瑶族自治县]（111.35,25.62）（113.96,25.53）（111.56,24.65）
        #吉林[白城/松原]（121.77,46.01）（124.80,45.18）（123.88,46.32）（122.28,44.29）
        #吉林[四平/长春]（123.34,43.57）（125.66,45.53）（124.46,42.85）（126.56,45.25）
        #吉林[辽源/吉林/通化]（124.88,42.81）（127.57,44.57）（125.33,41.75）（128.38,44.53）
        #吉林[吉林/通化/珲春]（126.51,43.88）（127.05,44.59）（125.59,40.95）（130.64,42.43）
        #江苏[徐州/连云港/宿迁]（117.29,34.22）（119.24,34.66）（118.28,34.08）
        #江苏[淮安/盐城/南京/南通]（119.02,33.61）（120.16,33.40）（118.28,32.12）（120.90,32.03）
        #江苏[马鞍山/常州/芜湖/无锡]（118.50,31.71）（119.95,31.82）（118.41,31.36）（120.31,31.49）
        #江西[九江/宜春/上饶]（115.97,29.71）（113.80,27.81）（118.36,28.51）
        #江西[萍乡/宜黄县/井冈山]（113.86,27.66）（116.65,27.60）（114.29,26.76）

        #江西[宁都县/南康区/石城县]（116.03,26.50）（114.01,25.63）（116.34,26.33）
        #江西[上犹县/南康区/瑞金]（114.22,26.18）（114.49,25.46）（116.05,25.72）
        #江西[汝城县/会昌区/全南县]（113.70,25.57）（116.04,25.63）（114.28,24.69）（115.80,24.60）
        #辽宁[四平/丹东]（123.79,43.51）（124.30,40.06）（125.46,42.17）
        #辽宁[沈阳/铁岭]（123.40,41.84）（123.60,43.03）（122.94,39.67）
        #辽宁[沈阳/大连/赤峰]（123.34,41.83）（121.17,38.80）（119.48,42.38）（118.87,40.86）
        #山东[顶中]（117.75,38.07）（117.72,37.35）（118.13,38.16）
        #山东[上左](116.80,37.81)(117.70,37.80)(117.83,37.48)
        #山东[烟台/威海]（121.26 37.52）（122.11 37.58）（122.31 37.01）
        #山东[青岛]（120.37,36.08）（120.60,36.11）（120.60,37.69）
        #山东[济宁/临沂/枣庄]（116.58,35.45）（119.54,35.44）（118.36,35.09）
        #山西[大同/朔州/沂州]（113.42,40.16）（112.45,39.38）（112.72,38.48）
        #山西[榆林/太原/阳泉/吕梁]（109.76,38.36）（113.53,37.91）（113.59,37.88）（111.14,37.56）
        #山西[延安/长治/临汾/晋城]（108.67,37.32）（112.83,35.51）
        #山西[韩城/阳城县/芮城县]（110.45,35.49）（112.42,35.49）（110.70,34.71）
        #陕西[神木县/保德县]（109.98,39.16）（109.28,38.60）（110.89,38.58）（111.13,39.03）
        #陕西[盐池县/绥德县/吴起县/永和县]（107.41,37.80）（110.27,37.51）（108.17,36.95）（110.63,36.78）
        #陕西[甘泉县/韩城]（108.72,36.33）（110.45,35.50）
        #陕西[合阳县/长武县/蒲城县]（110.16,35.25）（107.80,35.21）（109.59,34.97）
        #陕西[铜川/陇县/凤县/商洛]（108.95,34.91）（106.53,34.97）（106.52,33.93）（110.59,33.85）
        #陕西[留坝县/丹凤县/宁强县/郧阳县]（106.55,33.77）（110.75,33.77）（106.16,32.79）（111.34,32.77）
        #陕西[镇巴县/十堰/岚皋县/竹溪县]（107.54,32.72）（111.39,32.71）（107.95,32.28）（111.17,32.39）
        #天津[包含临省一点距离]（116.87.40.03）（117.79,40.08）（116.85,38.73）
        #新疆塔城(82.99,46.76)（90.57,46.84）（82.81,45.87）
        longtitude = 102.73
        latitude = 36.01
        #x = 6447
        x = 20
        #y = 3627
        y = 20
        index = 1

        #x循环
        for i in range(0,x+1):
         #longtitude1 = 73.04 + i*0.01
         longtitude1 = longtitude + i*0.01
         for j in range(0,y+1):
              #latitude1 = 18.00 + j*0.01
              latitude1 = latitude + j*0.01
              print "Longtitude : " + str(longtitude1)
              print "Latitude1 : " + str(latitude1)
              url = "http://areaapi.uc108.org:1505/api/Area/GetAreaNumber?longitude=" + str(longtitude1) + "&latitude=" + str(latitude1) 
              #url = "http://areaapi.uc108.org:1505/api/Area/GetAreaNumber?longitude=116.36&latitude=39.94"

              print "url is : "
              print (url)
              
              file_obj = open('testLog.txt','a+')
              
              try:
                print j
                response = urllib.urlopen(url)
                res = response.read()
                res_dict = json.loads(res)
                str_data = str(res_dict["Data"]) #原始为unicode
                #str_data = str(res_dict["Data"]["DistrictNumber"]) #原始为unicode
                str_statecode = str(res_dict["StateCode"]) #原始为int
                
                print "Data is : " + str(str_data)
                #print "Type of Data : " + str(type(str_data))
                #print "Type of StateCode : " + str(type(str_statecode))
                print ("\n")

                if (str_data != "000000"):
                    file_obj.writelines(str(index) + "\n")
                    file_obj.writelines( "Data : " + str_data + " " + "StateCode : " + " " + str_statecode + "\n")
                    file_obj.writelines("longtitude : " + str(longtitude1) + " " + "latitude : " +  str(latitude1) + "\n")
                    file_obj.writelines(url+"\n")
                    file_obj.writelines("\n")
                    index = index + 1

              except Exception, e:
                print e
              finally:
                if httpClient:
                    httpClient.close()
                    file_obj.close()
         

#if __name__ == "__main__":
#	'''
#	url = urllib.urlopen("http://areaapi.uc108.org:1505//api/Area/GetAreaNumber?longitude=116.36&latitude=39.94")
#	res = url.read()
#	res_dict = json.loads(res)
#	print(res_dict["StateCode"])
#	'''
#	LBS().try_shanghai()
